"""
Задача 05-02. Сумма и количество

Прочитайте числа через пробел и выведите две строки:

    Сумма: <сумма чисел>
    Количество: <сколько чисел>

Функции sum и len в этой задаче не использовать — считайте циклом.

Пример
------
Ввод:
4 8 15 16
Вывод:
Сумма: 43
Количество: 4
"""

# TODO: накопите сумму и количество в цикле
n = str(input())
numbers = n.split()
total_sum = 0
total = 0
for number in numbers:
    total_sum += int(number)
    total += 1
print(f"Сумма: {total_sum}\nКоличество: {total}")



