"""
Задача 02-16. Время года

Прочитайте порядковый номер месяца (целое число). Выведите время года:

- 12, 1, 2 — «зима»;
- 3, 4, 5 — «весна»;
- 6, 7, 8 — «лето»;
- 9, 10, 11 — «осень»;
- любой другой номер — «ошибка».

Пример
------
Ввод:
4
Вывод:
весна
"""

# TODO: прочитайте номер месяца и выведите время года

a = int(input())
if a == 12 or a == 1 or a==  2:
    print('Зима')
elif a == 3 or a == 4 or a == 5:
    print('Весна')
elif 6 <= a <= 8:
    print('Лето')
elif 9 <= a <= 11:
    print('Осень')
else:
    print('Ошибка')