"""
Задача 02-07. Оценка по баллам

Прочитайте количество баллов (целое число от 0 до 100) и выведите оценку:

- 90 и больше — «отлично»;
- от 75 до 89 — «хорошо»;
- от 60 до 74 — «удовлетворительно»;
- меньше 60 — «неудовлетворительно».

Пример
------
Ввод:
95
Вывод:
отлично
"""

# TODO: прочитайте балл и выведите оценку по шкале
n = int(input())
if n >= 90:
    print("отлично")
elif 75 <= n <= 89:
    print("хорошо")
elif 60 <= n <= 74:
    print("удовлетворительно")
else:
    print("неудовлетворительно")

