"""
Задача 02-09. Категория ИМТ

Прочитайте вес в килограммах (может быть дробным) и рост в метрах (может
быть дробным). Вычислите индекс массы тела:

    bmi = вес / рост ** 2

и выведите категорию:

- меньше 18.5 — «недостаточный»;
- от 18.5 до 25 (не включая 25) — «норма»;
- от 25 до 30 (не включая 30) — «избыточный»;
- 30 и больше — «ожирение».

Пример
------
Ввод:
70
1.75
Вывод:
норма
"""


# TODO: прочитайте вес и рост, вычислите ИМТ и выведите категорию
weight = float(input())
height = float(input())
bmi = weight / height ** 2
if bmi < 18.5:
    print('недостаточный')
elif bmi > 18.5 and bmi < 25:
    print('норма')
elif bmi > 30:
    print('избыточный')
else:
    print('ожирение')
