"""
Задача 03-10. Угадай число

Программа «загадала» число 42. В цикле читайте целые числа, пока не будет
введено 42, и на каждое число выводите подсказку:

- «больше» — если введённое меньше 42;
- «меньше» — если введённое больше 42.

Когда введут 42, выведите «угадал» и завершите программу.

Пример
------
Ввод:
10
50
42
Вывод:
больше
меньше
угадал
"""

TARGET = 42

# TODO: в цикле while читайте числа и выводите подсказки, пока не угадают

n = int(input())
for i in range(n):
    if n < 42:
        print('больше')
    elif n > 42:
        print('меньше')
    else:
        print('угадал')
    n = int(input())
print('угадал')