"""
Задача 03-17 ★. Второй максимум

Сначала поступает целое число n (n ≥ 2), затем n различных целых чисел.
Выведите второе по величине из них.

Списки и сортировку не использовать — отслеживайте два наибольших
значения по мере чтения.

Пример
------
Ввод:
5
3
9
1
7
5
Вывод:
7
"""

n = int(input())
max = int(input())
max_2 =int(input())

# TODO: читайте числа и отслеживайте два максимума; выведите второй
for i in range(n-1):
    n = int(input())
    if n > max:
        max_2 = max
        max = n
    elif n > max_2 and n <= max:
        max_2 = n
print(max_2)
